In [1]:
import pandas as pd
import numpy as np

# 1. Series

Series 정의

In [2]:
obj = pd.Series([1,3,5,np.nan,6,8], index=['a','b','c','d','e','f'])
print(obj)

a    1.0
b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
dtype: float64

In [11]:
# Series의 값만 확인하기
obj.values

array([ 1.,  3.,  5., nan,  6.,  8.])

In [12]:
# Series의 인덱스만 확인하기
obj.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [13]:
# Series의 자료형 확인하기
obj.dtypes

dtype('float64')

dictionary로 받기

In [21]:
sdata = {'Kim': 35000, 'Beomwoo': 67000, 'Joan': 12000, 'Choi': 4000}
obj3 = pd.Series(sdata)
obj3

Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
dtype: int64

In [16]:
obj3.name = 'Salary'
obj3.index.name = "Names"
obj3

Names
Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
Name: Salary, dtype: int64

In [18]:
# index 변경
obj3.index = ['A', 'B', 'C', 'D']
obj3

A    35000
B    67000
C    12000
D     4000
Name: Salary, dtype: int64

In [22]:
# 날짜를 index로
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

# 2. DataFrame

## 1) dataframe 정의

a) dictionary로 정의

In [26]:
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [27]:
# index
df.index

RangeIndex(start=0, stop=5, step=1)

In [28]:
# 컬럼
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [29]:
# 값 얻기
df.values

array([['Beomwoo', 2013, 1.5],
       ['Beomwoo', 2014, 1.7],
       ['Beomwoo', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2015, 2.9]], dtype=object)

In [30]:
df.tail(2)

   name  year  points
3   Kim  2016     2.4
4  Park  2015     2.9

In [31]:
df.head(2)

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7

In [32]:
# 행 열 전치
df.T

              0        1        2     3     4
name    Beomwoo  Beomwoo  Beomwoo   Kim  Park
year       2013     2014     2015  2016  2015
points      1.5      1.7      3.6   2.4   2.9

In [33]:
# 각 인덱스와 커럼에 이름붙이기
df.index.name = 'Num'
df.columns.name = 'Info'
df

Info     name  year  points
Num
0     Beomwoo  2013     1.5
1     Beomwoo  2014     1.7
2     Beomwoo  2015     3.6
3         Kim  2016     2.4
4        Park  2015     2.9

In [34]:
# describe() 함수는 DataFrame의 계산 가능한 값들에 대한 다양한 계산 값을 보여준다.
df.describe()

Info          year    points
count     5.000000  5.000000
mean   2014.600000  2.420000
std       1.140175  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2015.000000  2.900000
max    2016.000000  3.600000

b) DataFrame을 만들면서 columns와 index를 설정할 수 있다.

In [56]:
df2 = pd.DataFrame(data, columns=['year', 'name', 'points', 'penalty'],
                  index=['one', 'two', 'three', 'four', 'five'])
df2

       year name  points penalty
one    2014  NaN     1.5     NaN
two    2015  NaN     1.7     NaN
three  2016  NaN     3.6     NaN
four   2015  NaN     2.4     NaN
five   2016  NaN     2.9     NaN

In [51]:
# 인덱스 모두 재생성
df = df2.reset_index(drop=True)
df

   year name  points penalty
0  2014  NaN     1.5     NaN
1  2015  NaN     1.7     NaN
2  2016  NaN     3.6     NaN
3  2015  NaN     2.4     NaN
4  2016  NaN     2.9     NaN

## 2) DML

In [92]:
data = {"names": ["Kilho", "Kilho", "Kilho", "Charles", "Charles"],
           "year": [2014, 2015, 2016, 2015, 2016],
           "points": [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

### a) select

In [93]:
df2 = df.reindex(index=['one', 'two'], columns=['year'])
df2

     year
one  2014
two  2015

In [94]:
df['year']

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [95]:
df[['year','names']]

       year    names
one    2014    Kilho
two    2015    Kilho
three  2016    Kilho
four   2015  Charles
five   2016  Charles

### b) update

### c) alter table add colum

In [96]:
df['penalty'] = 0.5
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.5
two    2015    Kilho     1.7      0.5
three  2016    Kilho     3.6      0.5
four   2015  Charles     2.4      0.5
five   2016  Charles     2.9      0.5

In [97]:
# numpy 이용
df['zeros'] = np.arange(5)

In [98]:
df

       year    names  points  penalty  zeros
one    2014    Kilho     1.5      0.5      0
two    2015    Kilho     1.7      0.5      1
three  2016    Kilho     3.6      0.5      2
four   2015  Charles     2.4      0.5      3
five   2016  Charles     2.9      0.5      4

In [99]:
# Series이용
val = pd.Series([-1.2, -1.5, -1.7], index=['two','four','five'])
df['debt'] = val
df

       year    names  points  penalty  zeros  debt
one    2014    Kilho     1.5      0.5      0   NaN
two    2015    Kilho     1.7      0.5      1  -1.2
three  2016    Kilho     3.6      0.5      2   NaN
four   2015  Charles     2.4      0.5      3  -1.5
five   2016  Charles     2.9      0.5      4  -1.7

In [100]:
# 기존 column 이용
df['net_points'] = df['points'] - df['penalty']
df

       year    names  points  penalty  zeros  debt  net_points
one    2014    Kilho     1.5      0.5      0   NaN         1.0
two    2015    Kilho     1.7      0.5      1  -1.2         1.2
three  2016    Kilho     3.6      0.5      2   NaN         3.1
four   2015  Charles     2.4      0.5      3  -1.5         1.9
five   2016  Charles     2.9      0.5      4  -1.7         2.4

In [101]:
df['high_points'] = df['net_points'] > 2.0
df

       year    names  points  penalty  zeros  debt  net_points  high_points
one    2014    Kilho     1.5      0.5      0   NaN         1.0        False
two    2015    Kilho     1.7      0.5      1  -1.2         1.2        False
three  2016    Kilho     3.6      0.5      2   NaN         3.1         True
four   2015  Charles     2.4      0.5      3  -1.5         1.9        False
five   2016  Charles     2.9      0.5      4  -1.7         2.4         True

### d) alter table drop colum

In [102]:
del df['high_points']

In [103]:
del df['net_points']
del df['zeros']
df

       year    names  points  penalty  debt
one    2014    Kilho     1.5      0.5   NaN
two    2015    Kilho     1.7      0.5  -1.2
three  2016    Kilho     3.6      0.5   NaN
four   2015  Charles     2.4      0.5  -1.5
five   2016  Charles     2.9      0.5  -1.7

In [104]:
df.index.name = 'Order'
df.columns.name = 'Info'

### e) where 절

In [105]:
# 스칼라값 하나만 얻을 때
df.at['one','year']

2014

In [106]:
# 숫자사용, 스칼라
df.iat[0,0]

2014

In [107]:
# index 순서
df[0:3]

Info   year  names  points  penalty  debt
Order
one    2014  Kilho     1.5      0.5   NaN
two    2015  Kilho     1.7      0.5  -1.2
three  2016  Kilho     3.6      0.5   NaN

In [108]:
# index 이름
df.loc['two'] # 반환 형태는 Series

Info
year        2015
names      Kilho
points       1.7
penalty      0.5
debt        -1.2
Name: two, dtype: object

In [109]:
# 범위로 불러오기
df.loc['two' : 'four']

Info   year    names  points  penalty  debt
Order
two    2015    Kilho     1.7      0.5  -1.2
three  2016    Kilho     3.6      0.5   NaN
four   2015  Charles     2.4      0.5  -1.5

In [110]:
# [행, 열]
df.loc['two':'four', 'points']

Order
two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [111]:
df.loc[:,['year','names']]

Info   year    names
Order
one    2014    Kilho
two    2015    Kilho
three  2016    Kilho
four   2015  Charles
five   2016  Charles

In [61]:
# iloc 사용하기
df.iloc[3] # 3번째 행을 가져온다.

Info
year          2015
names      Charles
points         2.4
penalty        0.5
debt          -1.5
Name: four, dtype: object

In [62]:
df.iloc[3:5, 0:2]

Info     year    names
Order
four   2015.0  Charles
five   2016.0  Charles

In [65]:
# 연산자 사용
df['year'] > 2014

Order
one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [67]:
df.loc[df['year']>2014,:]

Info     year    names  points  penalty  debt
Order
two    2015.0    Kilho     1.7      0.5  -1.2
three  2016.0    Kilho     3.6      0.5   NaN
four   2015.0  Charles     2.4      0.5  -1.5
five   2016.0  Charles     2.9      0.5  -1.7

In [68]:
df.loc[df['names'] == 'Kilho',['names','points']]

Info   names  points
Order
one    Kilho     1.5
two    Kilho     1.7
three  Kilho     3.6

In [69]:
# numpy에서와 같이 논리연산을 응용할 수 있다.
df.loc[(df['points']>2)&(df['points']<3),:]

Info     year    names  points  penalty  debt
Order
four   2015.0  Charles     2.4      0.5  -1.5
five   2016.0  Charles     2.9      0.5  -1.7

In [71]:
# 새로운 값을 대입할 수도 있다.
df.loc[df['points'] > 3, 'penalty'] = 0

In [72]:
df

Info     year    names  points  penalty  debt
Order
one    2014.0    Kilho     1.5      0.5   NaN
two    2015.0    Kilho     1.7      0.5  -1.2
three  2016.0    Kilho     3.6      0.0   NaN
four   2015.0  Charles     2.4      0.5  -1.5
five   2016.0  Charles     2.9      0.5  -1.7
six    2013.0      Jun     4.0      0.0   2.1

### f) insert into 테이블명(속성, 속성, 속성, ...) values(값, 값, 값, ...)

In [112]:
# 새로운 행 삽입하기
df.loc['six',:] = [2013,'Jun',4.0,0.1,2.1]

In [113]:
df

Info     year    names  points  penalty  debt
Order
one    2014.0    Kilho     1.5      0.5   NaN
two    2015.0    Kilho     1.7      0.5  -1.2
three  2016.0    Kilho     3.6      0.5   NaN
four   2015.0  Charles     2.4      0.5  -1.5
five   2016.0  Charles     2.9      0.5  -1.7
six    2013.0      Jun     4.0      0.1   2.1

In [121]:
df.append(pd.Series({'year' : 2019, 'names' : 'jsh', 'points' : 9.9, 'penalty' : 0.5, 'debt' : 2}), ignore_index=True)

Info    year    names  points  penalty  debt
0     2014.0    Kilho     1.5      0.5   NaN
1     2015.0    Kilho     1.7      0.5  -1.2
2     2016.0    Kilho     3.6      0.5   NaN
3     2015.0  Charles     2.4      0.5  -1.5
4     2016.0  Charles     2.9      0.5  -1.7
5     2013.0      Jun     4.0      0.1   2.1
6     2019.0      jsh     9.9      0.5   2.0

## 3) na 값 다루기

In [73]:
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0  0.648756  0.105141  2.025383  0.623547
1  0.460721 -1.731191 -1.842115 -0.603244
2 -0.434504 -0.269841 -0.063841  0.049064
3  0.409129  0.191605 -0.285341 -0.451766
4 -0.898787  1.237363  0.605115 -1.345435
5 -0.347370 -0.019945 -1.837389 -0.327367

In [74]:
df.columns = ['A', 'B', 'C', 'D']
df.index = pd.date_range('20160701', periods=6)
#pandas에서 제공하는 date range함수는 datetime 자료형으로 구성된, 날짜 시각등을 알 수 있는 자료형을 만드는 함수
df.index

DatetimeIndex(['2016-07-01', '2016-07-02', '2016-07-03', '2016-07-04',
               '2016-07-05', '2016-07-06'],
              dtype='datetime64[ns]', freq='D')

In [75]:
# np.nan은 NaN값을 의미한다.
df['F'] = [1.0, np.nan, 3.5, 6.1, np.nan, 7.0]
df

                   A         B         C         D    F
2016-07-01  0.648756  0.105141  2.025383  0.623547  1.0
2016-07-02  0.460721 -1.731191 -1.842115 -0.603244  NaN
2016-07-03 -0.434504 -0.269841 -0.063841  0.049064  3.5
2016-07-04  0.409129  0.191605 -0.285341 -0.451766  6.1
2016-07-05 -0.898787  1.237363  0.605115 -1.345435  NaN
2016-07-06 -0.347370 -0.019945 -1.837389 -0.327367  7.0

In [76]:
# 행의 값중 하나라도 nan인 경우 그 행을 없앤다.
df.dropna(how='any')

                   A         B         C         D    F
2016-07-01  0.648756  0.105141  2.025383  0.623547  1.0
2016-07-03 -0.434504 -0.269841 -0.063841  0.049064  3.5
2016-07-04  0.409129  0.191605 -0.285341 -0.451766  6.1
2016-07-06 -0.347370 -0.019945 -1.837389 -0.327367  7.0

In [77]:
# 행의 값의 모든 값이 nan인 경우 그 행으 없앤다.
df.dropna(how='all')

                   A         B         C         D    F
2016-07-01  0.648756  0.105141  2.025383  0.623547  1.0
2016-07-02  0.460721 -1.731191 -1.842115 -0.603244  NaN
2016-07-03 -0.434504 -0.269841 -0.063841  0.049064  3.5
2016-07-04  0.409129  0.191605 -0.285341 -0.451766  6.1
2016-07-05 -0.898787  1.237363  0.605115 -1.345435  NaN
2016-07-06 -0.347370 -0.019945 -1.837389 -0.327367  7.0

In [78]:
# nan값에 값 넣기
df.fillna(value=0.5)

                   A         B         C         D    F
2016-07-01  0.648756  0.105141  2.025383  0.623547  1.0
2016-07-02  0.460721 -1.731191 -1.842115 -0.603244  0.5
2016-07-03 -0.434504 -0.269841 -0.063841  0.049064  3.5
2016-07-04  0.409129  0.191605 -0.285341 -0.451766  6.1
2016-07-05 -0.898787  1.237363  0.605115 -1.345435  0.5
2016-07-06 -0.347370 -0.019945 -1.837389 -0.327367  7.0

In [79]:
# nan값인지 확인하기
df.isnull()

                A      B      C      D      F
2016-07-01  False  False  False  False  False
2016-07-02  False  False  False  False   True
2016-07-03  False  False  False  False  False
2016-07-04  False  False  False  False  False
2016-07-05  False  False  False  False   True
2016-07-06  False  False  False  False  False

In [80]:
# F열에서 nan값을 포함하는 행만 추출하기
df.loc[df.isnull()['F'],:]

                   A         B         C         D   F
2016-07-02  0.460721 -1.731191 -1.842115 -0.603244 NaN
2016-07-05 -0.898787  1.237363  0.605115 -1.345435 NaN

In [81]:
pd.to_datetime('20160701')

Timestamp('2016-07-01 00:00:00')

In [82]:
df

                   A         B         C         D    F
2016-07-01  0.648756  0.105141  2.025383  0.623547  1.0
2016-07-02  0.460721 -1.731191 -1.842115 -0.603244  NaN
2016-07-03 -0.434504 -0.269841 -0.063841  0.049064  3.5
2016-07-04  0.409129  0.191605 -0.285341 -0.451766  6.1
2016-07-05 -0.898787  1.237363  0.605115 -1.345435  NaN
2016-07-06 -0.347370 -0.019945 -1.837389 -0.327367  7.0

## 4) drop 함수

In [83]:
# 특정 행 drop하기
df.drop(pd.to_datetime('20160701'))

                   A         B         C         D    F
2016-07-02  0.460721 -1.731191 -1.842115 -0.603244  NaN
2016-07-03 -0.434504 -0.269841 -0.063841  0.049064  3.5
2016-07-04  0.409129  0.191605 -0.285341 -0.451766  6.1
2016-07-05 -0.898787  1.237363  0.605115 -1.345435  NaN
2016-07-06 -0.347370 -0.019945 -1.837389 -0.327367  7.0

In [84]:
# 2개 이상도 가능
df.drop([pd.to_datetime('20160702'),pd.to_datetime('20160704')])

                   A         B         C         D    F
2016-07-01  0.648756  0.105141  2.025383  0.623547  1.0
2016-07-03 -0.434504 -0.269841 -0.063841  0.049064  3.5
2016-07-05 -0.898787  1.237363  0.605115 -1.345435  NaN
2016-07-06 -0.347370 -0.019945 -1.837389 -0.327367  7.0

In [85]:
# 특정 열 삭제하기
df.drop('F', axis = 1)

                   A         B         C         D
2016-07-01  0.648756  0.105141  2.025383  0.623547
2016-07-02  0.460721 -1.731191 -1.842115 -0.603244
2016-07-03 -0.434504 -0.269841 -0.063841  0.049064
2016-07-04  0.409129  0.191605 -0.285341 -0.451766
2016-07-05 -0.898787  1.237363  0.605115 -1.345435
2016-07-06 -0.347370 -0.019945 -1.837389 -0.327367

In [86]:
# 2개 이상의 열도 가능
df.drop(['B','D'], axis = 1)

                   A         C    F
2016-07-01  0.648756  2.025383  1.0
2016-07-02  0.460721 -1.842115  NaN
2016-07-03 -0.434504 -0.063841  3.5
2016-07-04  0.409129 -0.285341  6.1
2016-07-05 -0.898787  0.605115  NaN
2016-07-06 -0.347370 -1.837389  7.0

## 5) 데이터 분석용 함수

In [89]:
data = [[1.4, np.nan],
           [7.1, -4.5],
        [np.nan, np.nan],
        [0.75, -1.3]]
df = pd.DataFrame(data, columns=["one", "two"], index=["a", "b", "c", "d"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [90]:
# 행방향으로의 합(즉, 각 열의 합)
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [91]:
# 열방향으로의 합(즉, 각 행의 합)
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [92]:
# na값 포함하기
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [93]:
# 특정 열에서만 계산하기
df['one'].sum()

9.25

In [95]:
# 특정 행에서만 계산
df.loc['b'].sum()

2.5999999999999996

pandas에서 DataFrame에 적용되는 함수들

sum() 함수 이외에도 pandas에서 DataFrame에 적용되는 함수는 다음의 것들이 있다.

count 전체 성분의 (NaN이 아닌) 값의 갯수를 계산

min, max 전체 성분의 최솟, 최댓값을 계산

argmin, argmax 전체 성분의 최솟값, 최댓값이 위치한 (정수)인덱스를 반환

idxmin, idxmax 전체 인덱스 중 최솟값, 최댓값을 반환

quantile 전체 성분의 특정 사분위수에 해당하는 값을 반환 (0~1 사이)

sum 전체 성분의 합을 계산

mean 전체 성분의 평균을 계산

median 전체 성분의 중간값을 반환

mad 전체 성분의 평균값으로부터의 절대 편차(absolute deviation)의 평균을 계산

std, var 전체 성분의 표준편차, 분산을 계산

cumsum 맨 첫 번째 성분부터 각 성분까지의 누적합을 계산 (0에서부터 계속 더해짐)

cumprod 맨 첫번째 성분부터 각 성분까지의 누적곱을 계산 (1에서부터 계속 곱해짐)

In [96]:
df2 = pd.DataFrame(np.random.randn(6, 4),
                   columns=["A", "B", "C", "D"],
                   index=pd.date_range("20160701", periods=6))
df2

                   A         B         C         D
2016-07-01  0.307039 -0.769320 -0.589459  0.044263
2016-07-02 -1.823068 -1.976192 -2.018368  0.342213
2016-07-03 -1.088531  0.566012 -0.035878 -0.079621
2016-07-04 -1.211128  1.110359 -1.032575 -0.415084
2016-07-05  0.823219  0.527056 -0.183896 -0.647313
2016-07-06  0.312772  0.941755  0.877082  0.090295

In [97]:
# A열과 B열의 상관계수 구하기
df2['A'].corr(df2['B'])

0.3629209106929131

In [98]:
# B열과 C열의 공분산 구하기
df2['B'].cov(df2['C'])

0.8406219637641743

## 6) 정렬

In [99]:
dates = df2.index
random_dates = np.random.permutation(dates)
df2 = df2.reindex(index=random_dates, columns=["D", "B", "C", "A"])
df2

                   D         B         C         A
2016-07-05 -0.647313  0.527056 -0.183896  0.823219
2016-07-04 -0.415084  1.110359 -1.032575 -1.211128
2016-07-01  0.044263 -0.769320 -0.589459  0.307039
2016-07-02  0.342213 -1.976192 -2.018368 -1.823068
2016-07-06  0.090295  0.941755  0.877082  0.312772
2016-07-03 -0.079621  0.566012 -0.035878 -1.088531

In [102]:
# index가 오름차순이 되도록 정렬해보자
df2.sort_index(axis=0)

                   D         B         C         A
2016-07-01  0.044263 -0.769320 -0.589459  0.307039
2016-07-02  0.342213 -1.976192 -2.018368 -1.823068
2016-07-03 -0.079621  0.566012 -0.035878 -1.088531
2016-07-04 -0.415084  1.110359 -1.032575 -1.211128
2016-07-05 -0.647313  0.527056 -0.183896  0.823219
2016-07-06  0.090295  0.941755  0.877082  0.312772

In [101]:
# column을 기준으로?
df2.sort_index(axis=1)

                   A         B         C         D
2016-07-05  0.823219  0.527056 -0.183896 -0.647313
2016-07-04 -1.211128  1.110359 -1.032575 -0.415084
2016-07-01  0.307039 -0.769320 -0.589459  0.044263
2016-07-02 -1.823068 -1.976192 -2.018368  0.342213
2016-07-06  0.312772  0.941755  0.877082  0.090295
2016-07-03 -1.088531  0.566012 -0.035878 -0.079621

In [103]:
# 내림차순으로는?
df2.sort_index(axis=1, ascending=False)

                   D         C         B         A
2016-07-05 -0.647313 -0.183896  0.527056  0.823219
2016-07-04 -0.415084 -1.032575  1.110359 -1.211128
2016-07-01  0.044263 -0.589459 -0.769320  0.307039
2016-07-02  0.342213 -2.018368 -1.976192 -1.823068
2016-07-06  0.090295  0.877082  0.941755  0.312772
2016-07-03 -0.079621 -0.035878  0.566012 -1.088531

In [104]:
# 값 기준 정렬하기
# D열의 값이 오름차순이 되도록 정렬하기
df2.sort_values(by='D')

                   D         B         C         A
2016-07-05 -0.647313  0.527056 -0.183896  0.823219
2016-07-04 -0.415084  1.110359 -1.032575 -1.211128
2016-07-03 -0.079621  0.566012 -0.035878 -1.088531
2016-07-01  0.044263 -0.769320 -0.589459  0.307039
2016-07-06  0.090295  0.941755  0.877082  0.312772
2016-07-02  0.342213 -1.976192 -2.018368 -1.823068

In [105]:
df2["E"] = np.random.randint(0, 6, size=6)
df2["F"] = ["alpha", "beta", "gamma", "gamma", "alpha", "gamma"]
df2

                   D         B         C         A  E      F
2016-07-05 -0.647313  0.527056 -0.183896  0.823219  5  alpha
2016-07-04 -0.415084  1.110359 -1.032575 -1.211128  2   beta
2016-07-01  0.044263 -0.769320 -0.589459  0.307039  3  gamma
2016-07-02  0.342213 -1.976192 -2.018368 -1.823068  5  gamma
2016-07-06  0.090295  0.941755  0.877082  0.312772  2  alpha
2016-07-03 -0.079621  0.566012 -0.035878 -1.088531  1  gamma

In [106]:
# E열과 F열을 동시에 고려하여, 오름차순으로 하려면?
df2.sort_values(by=['E','F'])

                   D         B         C         A  E      F
2016-07-03 -0.079621  0.566012 -0.035878 -1.088531  1  gamma
2016-07-06  0.090295  0.941755  0.877082  0.312772  2  alpha
2016-07-04 -0.415084  1.110359 -1.032575 -1.211128  2   beta
2016-07-01  0.044263 -0.769320 -0.589459  0.307039  3  gamma
2016-07-05 -0.647313  0.527056 -0.183896  0.823219  5  alpha
2016-07-02  0.342213 -1.976192 -2.018368 -1.823068  5  gamma

In [107]:
# 지정한 행 또는 열에서 중복값을 제외한 유니크한 값만 얻기
df2['F'].unique()

array(['alpha', 'beta', 'gamma'], dtype=object)

In [108]:
# 지정한 행 또는 열에서 값에 따른 개수 얻기
df2['F'].value_counts()

gamma    3
alpha    2
beta     1
Name: F, dtype: int64

In [109]:
# 지정한 행 또는 열에서 입력한 값이 있는지 확인하기
df2['F'].isin(['alpha','beta'])

2016-07-05     True
2016-07-04     True
2016-07-01    False
2016-07-02    False
2016-07-06     True
2016-07-03    False
Name: F, dtype: bool

In [110]:
# F열의 값이 alpha나 beta인 모든 행 구하기
df2.loc[df2['F'].isin(['alpha','beta']),:]

                   D         B         C         A  E      F
2016-07-05 -0.647313  0.527056 -0.183896  0.823219  5  alpha
2016-07-04 -0.415084  1.110359 -1.032575 -1.211128  2   beta
2016-07-06  0.090295  0.941755  0.877082  0.312772  2  alpha

### 7) lamda 함수 활용

In [111]:
df3 = pd.DataFrame(np.random.randn(4, 3), columns=["b", "d", "e"],
                   index=["Seoul", "Incheon", "Busan", "Daegu"])
df3

                b         d         e
Seoul   -1.361700 -0.449081  0.863930
Incheon -0.250482  1.350726  1.082790
Busan    0.675217 -0.056146  1.821454
Daegu   -0.540611  0.875018  0.027356

In [112]:
func = lambda x: x.max() - x.min()

In [113]:
df3.apply(func, axis=0)

b    2.036917
d    1.799807
e    1.794097
dtype: float64

In [114]:
df3.apply(func, axis=1)

Seoul      2.225629
Incheon    1.601208
Busan      1.877599
Daegu      1.415629
dtype: float64

## 8) dataframe 병합

In [79]:
df1 = pd.DataFrame(list(range(5)))
df2 = pd.DataFrame(list(range(5,10)))
df3 = pd.DataFrame(list(range(10,15)))

dfs = [df1, df2, df3]

In [80]:
df1

   0
0  0
1  1
2  2
3  3
4  4

In [81]:
df2

   0
0  5
1  6
2  7
3  8
4  9

In [82]:
df3

    0
0  10
1  11
2  12
3  13
4  14

### a) concat 연산

In [83]:
#옆으로 합침
pd.concat(dfs, axis=1)

   0  0   0
0  0  5  10
1  1  6  11
2  2  7  12
3  3  8  13
4  4  9  14

In [84]:
# 세로로 합침
pd.concat(dfs, axis=0)

    0
0   0
1   1
2   2
3   3
4   4
0   5
1   6
2   7
3   8
4   9
0  10
1  11
2  12
3  13
4  14

## 9) join 연산

In [88]:
left = pd.DataFrame({'key' : ['foo', 'bar'], 'lval' : [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [89]:
left

   key  lval
0  foo     1
1  bar     2

In [90]:
right

   key  rval
0  foo     4
1  bar     5

### a) inner join

In [91]:
pd.merge(left, right, on= 'key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

## 10) group by

In [123]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    })
df

     A      B         C         D
0  foo    one  0.379140 -0.100220
1  bar    one -0.544702 -1.560573
2  foo    two  1.022845 -1.622437
3  bar  three -1.327158  0.410447
4  foo    two -0.168279  1.127542
5  bar    two  0.039225 -1.148211
6  foo    one -0.796983  0.072364
7  foo  three -0.920522  0.198399

In [124]:
df.groupby('A').sum()

            C         D
A
bar -1.832635 -2.298337
foo -0.483799 -0.324352

In [128]:
dfx = df.groupby(['A','B']).sum()

stack 메소드

In [131]:
stacked = dfx.stack()
stacked

A    B
bar  one    C   -0.544702
            D   -1.560573
     three  C   -1.327158
            D    0.410447
     two    C    0.039225
            D   -1.148211
foo  one    C   -0.417843
            D   -0.027856
     three  C   -0.920522
            D    0.198399
     two    C    0.854566
            D   -0.494895
dtype: float64

In [133]:
unstacked = stacked.unstack()
unstacked

                  C         D
A   B
bar one   -0.544702 -1.560573
    three -1.327158  0.410447
    two    0.039225 -1.148211
foo one   -0.417843 -0.027856
    three -0.920522  0.198399
    two    0.854566 -0.494895

In [134]:
stacked.unstack(1)

B           one     three       two
A
bar C -0.544702 -1.327158  0.039225
    D -1.560573  0.410447 -1.148211
foo C -0.417843 -0.920522  0.854566
    D -0.027856  0.198399 -0.494895

In [135]:
stacked.unstack(0)

A             bar       foo
B
one   C -0.544702 -0.417843
      D -1.560573 -0.027856
three C -1.327158 -0.920522
      D  0.410447  0.198399
two   C  0.039225  0.854566
      D -1.148211 -0.494895

## 11) pivot 테이블

In [138]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.453296 -0.168158
1     one  B  foo  1.148221  0.087340
2     two  C  foo -0.380659  0.688795
3   three  A  bar  1.563099  0.273762
4     one  B  bar -2.264010 -0.930733
5     one  C  bar  0.406237  1.924884
6     two  A  foo  0.580214  0.519338
7   three  B  foo -1.739458 -0.371784
8     one  C  foo -0.777081 -0.592865
9     one  A  bar  0.199233 -1.155249
10    two  B  bar  1.424584  0.941336
11  three  C  bar -0.271397  0.810805

In [139]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.199233  0.453296
      B -2.264010  1.148221
      C  0.406237 -0.777081
three A  1.563099       NaN
      B       NaN -1.739458
      C -0.271397       NaN
two   A       NaN  0.580214
      B  1.424584       NaN
      C       NaN -0.380659

## 12) 시계열 데이터

### a) 시간으로 묶기

In [150]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [152]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.head()

2012-01-01 00:00:00    428
2012-01-01 00:00:01    307
2012-01-01 00:00:02    152
2012-01-01 00:00:03    342
2012-01-01 00:00:04    162
Freq: S, dtype: int32

In [144]:
# 시간을 묶을 수 있다.
ts.resample('1Min').sum()

2012-01-01 00:00:00    16600
2012-01-01 00:01:00     9891
Freq: T, dtype: int32

### b) 다른지역의 시간으로 바꾸기

In [145]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    0.060540
2012-03-07   -0.577627
2012-03-08   -0.331066
2012-03-09    0.908150
2012-03-10    0.117572
Freq: D, dtype: float64

In [147]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    0.060540
2012-03-07 00:00:00+00:00   -0.577627
2012-03-08 00:00:00+00:00   -0.331066
2012-03-09 00:00:00+00:00    0.908150
2012-03-10 00:00:00+00:00    0.117572
Freq: D, dtype: float64

In [149]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.060540
2012-03-06 19:00:00-05:00   -0.577627
2012-03-07 19:00:00-05:00   -0.331066
2012-03-08 19:00:00-05:00    0.908150
2012-03-09 19:00:00-05:00    0.117572
Freq: D, dtype: float64

### c) 시간 표현 ↔ 기간 표현으로 변환

In [153]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31    0.201924
2012-02-29   -0.530071
2012-03-31   -1.401975
2012-04-30    0.507363
2012-05-31   -0.075408
Freq: M, dtype: float64

In [157]:
# 시간 >> 기간
ps = ts.to_period()
ps

2012-01    0.201924
2012-02   -0.530071
2012-03   -1.401975
2012-04    0.507363
2012-05   -0.075408
Freq: M, dtype: float64

In [158]:
# 기간 >> 시간
ps.to_timestamp()

2012-01-01    0.201924
2012-02-01   -0.530071
2012-03-01   -1.401975
2012-04-01    0.507363
2012-05-01   -0.075408
Freq: MS, dtype: float64

###  d) 시간연산

분기별 9시로 시간을 조정해보자

In [159]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
prng

PeriodIndex(['1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
             '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
             '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
             '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
             '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
             '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
             '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
             '2000Q3', '2000Q4'],
            dtype='period[Q-NOV]', freq='Q-NOV')

In [164]:
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.head()

1990Q1    0.575650
1990Q2    0.614246
1990Q3    1.772905
1990Q4    1.114023
1991Q1    0.906387
Freq: Q-NOV, dtype: float64

In [162]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00   -1.876041
1990-06-01 09:00    0.116630
1990-09-01 09:00   -0.402021
1990-12-01 09:00    0.912201
1991-03-01 09:00   -1.346648
Freq: H, dtype: float64

## 13) 카테고리 변수

In [168]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [169]:
df["grade"] = df["raw_grade"].astype("category")
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [170]:
# 카테고리 만들기
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [172]:
# 카테고리 변경
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [174]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [175]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [176]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

## 14) csv, excel 입출력

In [ ]:
# csv write
df.to_csv('foo.csv')

In [ ]:
# csv read
pd.read_csv('foo.csv')

In [ ]:
# excel write
df.to_excel('foo.xlsx', sheet_name='Sheet1')

In [ ]:
# excel read
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])